tutorials/Verification/background/constant/waveDictOpposite
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDictOppsite;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../myVars" //Include global variables

waveType        regular;

waveTheory      StokesIII;

genAbs          1;

absDir          0.0;//666;

nPaddles        1;

wavePeriod      $wave_period;

waveHeight      0.0;//$wave_height;

waveDir         0;

wavePhase       1.57079633;

tSmooth         0;

uCurrent0       (4 0 0);

uCurrent1       (2 0 0);

uCurrent2       (1 0 0);

z1             -30; 

z2             -60;



// ************************************************************************* //


// Parameters for setOla
setWaterLevel   0; // Still water level (Z, in m)
setWaterDepth   105; // Water depth to use in calculations (if irregular bottom)

// Change both entries to true to re-read this dictionary upon restart.
rereadAlpha     false;
rereadU         false;

