tutorials/Verification/background/0.orig/include/logLawInlet
// Logarithmic profile inlet condition

type fixedValue;
value #codeStream
{
	codeInclude
	#{
		#include "fvCFD.H"
		#include <random>
	#};

	codeOptions
	#{
		-I$(LIB_SRC)/finiteVolume/lnInclude \
		-I$(LIB_SRC)/meshTools/lnInclude
	#};

	codeLibs
	#{
		-lmeshTools \
		-lfiniteVolume
	#};

	code
	#{
		const IOdictionary& d = static_cast<const IOdictionary&>
		(
			dict.parent().parent()
		);

		const fvMesh& mesh = refCast<const fvMesh>(d.db());
		const label id = mesh.boundary().findPatchID("inlet_wind");
		const fvPatch& patch = mesh.boundary()[id];

		vectorField U(patch.size(), vector(0, 0, 0));

		//const scalar U_ref = 12; //Hub height vel
		//const scalar z_ref = 150.0; //Hub height
		//const scalar z_0 = 0.01; // Surface roughness length	
		//const scalar z_ground = 16.0; //Ground height
		scalar U_h = 0.0; //Height-varying velocity

		forAll(U, i)
		{
			const scalar z = patch.Cf()[i][2];
			if (z-$z_ground>$z_0) // Above ground height
			{	
				std::random_device rd;
				std::mt19937 gen(rd());
				std::uniform_real_distribution<> dis(0.98,1.02);
				double randomNumber = dis(gen);
				
				U_h = $U_ref * log((z-$z_ground)/$z_0)/log(($z_ref-$z_ground)/$z_0) * randomNumber; //Log profile
				U[i] = vector(U_h, 0., 0.);	
			} 
			else U[i] = vector(0., 0., 0.);	 
		};

		U.writeEntry("",os);

	#};

};
